Documents/ро_Реестры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_Реестры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучКорректировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказНаряда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОборудования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ппНомерОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Заключения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ро_Реестры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;
	
	КоличествоПозиций =  ЗаказНаряды.Количество();
	СуммаДокумента = ЗаказНаряды.Итог("Цена");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Организация)=Ложь Тогда
		Организация = Константы.ОсновнаяОрганизация.Получить();
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Ответственный) = Ложь Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕСЛИ;

КонецПроцедуры


Процедура ДвиженияРабота(Отказ)
	
	Запрос =новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |  ЗаказНаряд,
				   |  ппНомерОборудования,
				   |  Оборудование,
				   |  SUM(КолОстаток) КолОстаток
				   |FROM (
				   |SELECT
	               |	ОстатокРООстатки.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРООстатки.КолОстаток КАК КолОстаток,
	               |	ОстатокРООстатки.ппНомерОборудования КАК ппНомерОборудования,
	               |	ОстатокРООстатки.Оборудование КАК Оборудование
	               |ИЗ
	               |	РегистрНакопления.РаботаРО.Остатки(, ЗаказНаряд В (&Мас)) КАК ОстатокРООстатки
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	ОстатокРО.ЗаказНаряд КАК ЗаказНаряд,
	               |	ОстатокРО.Кол КАК КолОстаток,
	               |	ОстатокРО.ппНомерОборудования КАК ппНомерОборудования,
	               |	ОстатокРО.Оборудование КАК Оборудование
	               |ИЗ
	               |	РегистрНакопления.РаботаРО  КАК ОстатокРО
				   |WHERE
				   |   ЗаказНаряд В (&Мас)
				   |) WWW
				   |
				   |GROUP BY
				   |  ЗаказНаряд,
				   |  ппНомерОборудования,
				   |  Оборудование
				   |
				   |";
	
	
	Запрос.УстановитьПараметр("Дт",Дата);
	Запрос.УстановитьПараметр("Мас",ЗаказНаряды.ВыгрузитьКолонку("ЗаказНаряд"));
	
	ТБл = Запрос.Выполнить().Выгрузить();
	
	СткФлт = новый Структура("ЗаказНаряд,ппНомерОборудования,Оборудование");
	
	Для каждого Стр из ЗаказНаряды Цикл
		
		ЗаполнитьЗначенияСвойств(СткФлт,Стр);
		
		масНС = Тбл.НайтиСтроки(СткФлт);
		Кол =1;
		
		Если МасНС.Количество()=0 или масНс[0].КолОстаток<>Кол ТОгда
			Сообщить("Заказ-наряд № "+Стр.ЗаказНаряд.Номер+" "+Стр.ЗаказНаряд.Оборудование+" нет в отгрузке!");
			отказ=Истина;
			Продолжить;
		КонецеСЛИ;
		
		НовЗап = Движения.РаботаРО.Добавить();
		НовЗап.ВидДвижения=ВидДвиженияНакопления.Расход;
		новЗап.Период = Дата;
		новЗап.ЗаказНаряд = Стр.ЗаказНаряд;
		новЗап.Оборудование = Стр.Оборудование;
		новЗап.ппНомерОборудования = Стр.ппНомерОборудования;
		новЗап.Цена = Стр.Цена;
		новЗап.кол = Кол;
		
	КонецЦикла;
	
	Движения.РаботаРО.Записать();
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияРабота(Отказ);
КонецПроцедуры
